# Вывести на экран строку "Hello world"
print('Hello world')

# Вывести на экран пять звездочек (*)
print(5 * '*')

# Вывести на экран квадрат 5 на 5 заполненный символами '#'

for _ in range(5):
    print(5 * '#')